In [2]:
import numpy as np
import pandas as pd

#### **MultiIndex**

**Объект MultiIndex** -

In [3]:
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,18976457, 19378102, 20851820, 25145561]
pop = pd.Series(data=populations, index=index)

In [4]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [5]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [6]:
pop = pop.reindex(index)

In [7]:
# Здесь первые два столбца представления объекта Series отражают значения мультииндекса, а третий столбец — данные.
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [8]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

**unstack** - Преобразует мультеиндексный объект Series в DataFrame

In [9]:
pop_df = pop.unstack()

In [10]:
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

**stack** - Выполняет обратную операцию, преобразует объект DataFrame в мультииндексный объект Series

In [11]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

**Манипуляция над мультииндексными объектами**

In [12]:
pop_under18 =  [9267089, 9284094,4687374, 4318033, 5906301, 6879014]
pop_df = pd.DataFrame({'total':pop,
                      'under18':pop_under18})

In [13]:
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [14]:
pop_under18_attention = pop_df['under18'] / pop_df['total']

In [15]:
pop_under18_attention.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [16]:
pop_df['under18 attention'] = pop_under18_attention

In [17]:
pop_df

                    total  under18  under18 attention
California 2000  33871648  9267089           0.273594
           2010  37253956  9284094           0.249211
New York   2000  18976457  4687374           0.247010
           2010  19378102  4318033           0.222831
Texas      2000  20851820  5906301           0.283251
           2010  25145561  6879014           0.273568

**Методы создания мультииндексов**

Наиболее простой метод создания мультииндексированного объекта **Series** или 
**DataFrame** — передать в конструктор список из двух или более индексных массивов. 
Например

In [18]:
df = pd.DataFrame(np.random.rand(4, 2), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], columns=['data1', 'data2'])

In [19]:
df

        data1     data2
a 1  0.619751  0.585259
  2  0.307746  0.254601
b 1  0.351518  0.466929
  2  0.148339  0.329750

Если передать словарь с соответствующими кортежами в качестве ключей, библиотека Pandas автоматически распознает такой синтаксис и будет по умолчанию 
использовать мультииндекс:

In [20]:
data = {('California', 2000):111111,
       ('California', 2010): 222222,
        ('Texas', 2000): 333333,
        ('Texas', 2010): 444444,
        ('New York', 2000): 555555,
        ('New York', 2010): 666666}
ser = pd.Series(data=data)

In [21]:
ser

California  2000    111111
            2010    222222
Texas       2000    333333
            2010    444444
New York    2000    555555
            2010    666666
dtype: int64

In [22]:
df2 = pd.DataFrame(data=ser, columns=['data1'])

In [23]:
df2

                  data1
California 2000  111111
           2010  222222
Texas      2000  333333
           2010  444444
New York   2000  555555
           2010  666666

**Явные конструкторы для объектов MultiIndex**

In [24]:
mind = pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

In [25]:
print(mind.codes)
print(mind.levels)

[[0, 0, 1, 1], [0, 1, 0, 1]]
[['a', 'b'], [1, 2]]

In [26]:
mind

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

**Названия уровней мультииндексов**

In [27]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [30]:
pop.index.names = ['state', 'year']

In [31]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [45]:
df = pd.DataFrame(pop, columns=['population'])

In [46]:
# Датафрейм с мультиндексами строк
df

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

**Мультииндекс для столбцов**

In [49]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]], names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']], names=['subject', 'type'])

In [61]:
# Имитационные данные
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data+=37

In [62]:
data

array([[57. , 37.2, 28. , 37.4, 35. , 36.8],
       [45. , 39. , 50. , 37. , 34. , 35.9],
       [39. , 37. , 28. , 35.8, 46. , 35.2],
       [30. , 36. , 40. , 35.7, 37. , 36.1]])

In [63]:
health_data = pd.DataFrame(data=data, index=index, columns=columns)

In [64]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      57.0  37.2  28.0  37.4  35.0  36.8
     2      45.0  39.0  50.0  37.0  34.0  35.9
2014 1      39.0  37.0  28.0  35.8  46.0  35.2
     2      30.0  36.0  40.0  35.7  37.0  36.1

In [76]:
health_data['Bob'].loc[2013]

type     HR  Temp
visit
1      57.0  37.2
2      45.0  39.0

In [77]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [79]:
pop['California', 2010]

37253956

In [81]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [94]:
pop.loc['California', 2001:2010]

state       year
California  2010    37253956
dtype: int64

In [135]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      57.0  37.2  28.0  37.4  35.0  36.8
     2      45.0  39.0  50.0  37.0  34.0  35.9
2014 1      39.0  37.0  28.0  35.8  46.0  35.2
     2      30.0  36.0  40.0  35.7  37.0  36.1

#### **IndexSlice**

In [136]:
idx = pd.IndexSlice

In [137]:
health_data.loc[idx[:, 1], idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      57.0  28.0  35.0
2014 1      39.0  28.0  46.0

In [138]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### **Перегруппировка индексов**

In [156]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.330313
      2      0.410620
c     1      0.570567
      2      0.420933
b     1      0.910764
      2      0.951271
dtype: float64

In [160]:
data.iloc[0:1:]

char  int
a     1      0.330313
dtype: float64

In [164]:
# data.loc['a':'b'] - Ошибка, потому что индексы в столбце 'Char' не отсортированы лексикографически
data = data.sort_index()

In [166]:
data

char  int
a     1      0.330313
      2      0.410620
b     1      0.910764
      2      0.951271
c     1      0.570567
      2      0.420933
dtype: float64